packages/django-jbank/django-jbank-3.8.6.tar.gz/django-jbank-3.8.6/logs/ws/00000026a.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pkif="http://danskebank.dk/PKI/PKIFactoryService" xmlns:elem="http://danskebank.dk/PKI/PKIFactoryService/elements">
  <soapenv:Header/>
  <soapenv:Body>
    <pkif:CreateCertificateIn>
      <pkif:RequestHeader>
        <pkif:SenderId>6D3142</pkif:SenderId>
        <pkif:CustomerId>6D3142</pkif:CustomerId>
        <pkif:RequestId>26</pkif:RequestId>
        <pkif:Timestamp>2020-07-20T21:19:22.455021+03:00</pkif:Timestamp>
        <pkif:InterfaceVersion>1</pkif:InterfaceVersion>
        <pkif:Environment>customertest</pkif:Environment>
      </pkif:RequestHeader>
    <EncryptedData xmlns="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Element">
<EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/>
<KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#">
<EncryptedKey xmlns="http://www.w3.org/2001/04/xmlenc#">
<EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/>
<KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#">
<X509Data>
<X509Certificate>MIIFATCCAumgAwIBAgIFAQjv8bkwDQYJKoZIhvcNAQELBQAwgZgxEDAOBgNVBAMT
B0RCR1JPT1QxCzAJBgNVBAYTAkRLMRMwEQYDVQQHEwpDb3BlbmhhZ2VuMRAwDgYD
VQQIEwdEZW5tYXJrMRowGAYDVQQKExFEYW5za2UgQmFuayBHcm91cDEaMBgGA1UE
CxMRRGFuc2tlIEJhbmsgR3JvdXAxGDAWBgNVBAUTDzYxMTI2MjI4MTExMDAwMzAe
Fw0yMDAyMDQxMjAwMDBaFw0yMjAyMDQxMjAwMDBaMIGYMRAwDgYDVQQDEwdEUENS
WVBUMQswCQYDVQQGEwJESzETMBEGA1UEBxMKQ29wZW5oYWdlbjEQMA4GA1UECBMH
RGVubWFyazEaMBgGA1UEChMRRGFuc2tlIEJhbmsgR3JvdXAxGjAYBgNVBAsTEURh
bnNrZSBCYW5rIEdyb3VwMRgwFgYDVQQFEw82MTEyNjIyODQ5MTAwMDkwggEgMA0G
CSqGSIb3DQEBAQUAA4IBDQAwggEIAoIBAQCmSUzQYj0Fx3jwvkz0lhmyyXRKwo5T
hts+1xFrG7euQ6oIMUJJpr8tgKxwDxdxxK/RXaYCHRH9mpIoyxCPlS3reRF4BMB6
gL2KOINnRyC3jmJ7kYHyWdhYfMb5VPIvusqPXc91HdVJb6rxvVSrTy/dB+V1od2q
uHNxA+Luhno37CXU1STrVvSrgHzOm45MROryuOu0lWY+d49tWZN9ilNI2Rf8mJjT
ZVKwJu4v02jXLGAqWpXQX0vxa7nI1D0xkOqnTvd04iDOdDE+jRtiy3SF8508LRqQ
jRH+9TZbX++yFd9Z/AR2h6AwM8OsLSC1QMJG7KeJw8st7K9i8KEOdglpAgEDo1Iw
UDAfBgNVHSMEGDAWgBTrVX/FmGlwJqoQ3fgyj1cJ40A/OjAdBgNVHQ4EFgQUMowN
BX+7Vy5lfO+d+tCxZ+ZupdYwDgYDVR0PAQH/BAQDAgQwMA0GCSqGSIb3DQEBCwUA
A4ICAQA+TV7cAPm5mKIAzTfuS4x4/KAlysTXZ3o0F2fYZmylNnUafi0+T21utPAv
bBYVFpr9fRq+q0L75ZCqU4pDvRLpHF7Q0RZ01ra7otVS78saxc/YUql+MsnHxeUw
9F8FJx7234KlRkhmY8xB743T/LQcp3zCRYUd0Rn2Ocaq7YoYGnx8QALItmJcagsX
MwYVsvXtWHHaDGFpcaivLX3e8cVQ+nI7slq1EfJ5xEdtSZ/zcGv+Ve4S6D1HLQ/K
oTQMzematrVvwwJMuqLMQdA1Pdtau3niupB3Se7AUq0bEZYF04Zlo4sOE21K9gSt
lJ5tSq0ohli02uXuQ/ggsqZSIH4t9WirWOMpS4KFkub02AYaicbm6SUyVg+odEaj
cFz+TEqd9C7cGgBL6MkLxXGj0DX64z4yU9lMlqQ8CzuZi5cMfpxvHVm4E+etLnYf
fzZ6jPnf3RbVumxPaRqnz6vceijWtmESg6cBei+phPzMCjjrXP0xng3+Bzqdn/lY
e8znS54o+UWJcENwvGc6tsUtBYGJOe6srIJHrXQKTG3DN6oDN2U5zT4cUBFvlHjx
fdj14m0Y0+gE90iTUJknWVRyyNDhPbYG1YCHRItVUxpGIp9tsV5FRP5qVbiMC7ba
hEsDAxMvL29i1vJbnJPT9e4OPkhEN5IqVQbu0QeOKMYT/YMZZQ==</X509Certificate>
</X509Data>
</KeyInfo>
<CipherData>
<CipherValue>ksZZKhAEDP9Hv8fwffXFyZtf/NHWuGHGc/QRdRNezqh0GRGl2li03VVaQrtWvAFd
jIk9k1RJN6kzP1lzpzzOKjdRhMlfnz3asBMU8SdYY99auHNNtWmewVqF6XnfXoY0
t1Jp097s+0vy9r+e+BxBQxXYb2k7KkWo+1A7QXhy1oalSjczvWBLugSPKBrXrysD
BzSO1qB2UbLI+fUICV0+8HQaJe0hop9bSkzX2QrcQ63PX7s+IdK6YslcvKZEW5b8
UQq5vKlrODkYbufFDXSOjd25jckONfHrb1QxO0zyjukgtINjH9sTxOAjaLurUjIf
AmhuYF1JzSAPf1E/hCBpDw==</CipherValue>
</CipherData>
</EncryptedKey>
</KeyInfo>
<CipherData>
<CipherValue>XrW0SDkZKn1TsMZLcetjnsNpYdbe1y7kjbtVbd1Vbrp4JcRjnxrFkuFn1YIaW7z7
eZfQD0TSX6eKjkkpVQNZ334ipZuxzu5qtJxg7Apsxr83MgaiSLRtGeGN0PxUzu5X
9e/Wu8DKm7ZmVogSVrllR+CTtUo5TCBQYaOv8KyoEcX5/tjIoZ3aEK/Ckpe3r5qi
z3G7vcS+/GCAbco7jSO1CVmmIMMgRFYjFcd9PmRaX7tkjxT7iYytAVQ0PyfV1lkQ
MGSdu7LlPTW6g2kzNezBvI7sKDk+BzLErF/ps2P7qmn+9pfRpAC/OU25LIAn0h6e
fx/7lkH6Ab8fH40LqDjkb/VqByLr2eGYCTkYJHykEd2LTqG71GgccVUkKiqgG/+7
UDDSYbATRTci0/fy0K411n2XCF7SO06zdZC9aINT+Pofkgz5CeowYnpJ8ugMwepH
TSwbQNVVAIY4cqD7qSRLGqmC97W4v+9FHQpMpWND0b9plER+gZvi8RFYXb39tnvQ
hTnEUQibLjNtXDNCGykJyb1/lnD4RYGe+P4hExgLYxehZKzK3A/peCR2bkubvaXd
rP1AFpmJXJRQ6jAYymJLWziJPq2V3eExfFd4ci9R+ZPZEAMlaYFnWYVZDWOF7A/C
6dybySKAdgSMa4mZGReyNIgWrQ7ykiyx0pLwFpReBztTcABB5b5pjOhoQOPrUVGE
2Lc/Y+RbBXVncrAzYxOcmZ2G0kXl5NQmsF7Z3jZlwa0fAC/fH6+CbxNe/zWGIKKc
VuSnUc3U4g/DBh0U/LMOIRqPNA9OYMZgaMcvjpu0WoMjf5GG7LUoJNDA2SSJdHYs
YjHxLhmqzDol/8Ug/hGExHjgNs5SaHxp/543O3I2iJXPPLcY/7YjLxdR8HgqDTZw
SO0ZbDTzb4/LXGBOOvjQBHhcKlU+AgyQLMubgEu/jaZg37gyn28c1XRY1OIr5XRQ
hvloTCAZQdZOGsILiewJ/uxeynjsVhKDtkdtQnRB95BiDYBmUg1/kTKuok0dFhul
jWOoNxBLAORzmQPegJBy8gzxENhFYKe2LY/bHj3b1/FjgijVCdDW1ClFh2hmOOk2
J+uZHnMYJHGjHq3VwSqexv3EhOf2zkjzWJcbG0JppiBKHqx1nuP90pfbBx2a5B3M
IMDIlxQZLM4YL533uqdXBOx4j8yrOt6/6EpfYtVcKnV9mvvaJ/OcjZ1eusEVONLj
AfsYuMZLLfDSAQ4tqa1eAiH4FtDHWavjfEzA3GxvXKUEVUXVMSXBHN4cDq3/ofbW
K1+XGs9S8+IxTtVNzEhjSR00/M28QMnX/2zB+j/y1UfVdGbfWKva8TNrUc882eVP
vvHKbm54eKVK9KJOzqtLLTp6ARlAk2ZMBw/g2OY5F3zvUOjPNsGtHUkiZY9XZqKS
ep6CgAClhpZm3kNgt+Izf6ZWNgwJ1LpJO5XiQo2D4K9TqIkmgIf1fFANgItVq/Mc
A6VAV1PsuPCc3lr+TRyD3t7fbGWzjVvucmd64MOdTlEbjjaDg2w8JgCdPIqR1lw9
UPC0t6FMPgr9rqFczbNjk+3Pq1MAMFlSLVs5c4v7ErvN0jttxGpkXZoEMrVpyM2d
MueukHYJIa2FD3NUh+KR9si/mD3nEyFH5XkGZpxRBJnWqTkBGdomu3Thd/aSYbXe
4YhuSOAI6EvYo99RIGLxwGNEfIx96vNqDG5y80v3DRJ0E+5Q3hy7BapjeIy0hTjI
jplGpqlO1B0Lwq7Y0co/HWQlGNa7Z8PiOkH8iuLORBXMSeCBC+AgZmBoEVTdMrNK
A3pj17KgGqWkJNrYnIzu3KR+3h6r+z739Ag6BX2i7AiANCCaDpbscnabAms1Tjjy
ZxGIUb9+7Bjn3kj1yvIiQ36TL3CvoK3GqMTRMll3BK9RuNckL/TobdO19Zck2/rm
YZUirD5kGL/40an9GjFgi3wwh8aqrFDuSGYl1cZoGwUmjXdHOta7eq9Zo4SzdI99
Vukj8dVL5D+wPkV7fEsUj9etkjG12E9vfBKY9Tr62MR9kOmwtn9q43tyh5uc5nPh
mSXAtQ/p9vr+7KtXYNdhGaw6Vii6AAVxhCrr+X58T5z2Qn4mGnoWkOVsM93ad/k0
O6rcoNLav9g/PgZryDy12Lpgc7DxaKRAqm4f0P7NGxbfCa+ZpvXP0jatnZjqgum7
seblVUDrCmvXmpBff/8rwQ3m6KViS78y53FXPKExLMq6DzXUlJhC8OocPMuuXPw+
FIz60IGaFK1q1CoWr3F5TiM0IIMnjZ2KemZ3WJwZPiJKLboVLoHXu8keibMrI44m
pMKJgKcA3LJLr8Uz0BioKPfKcNsJCv7cjbLP+Y+pvNyUD9q30OvyY7Aaln/F7bwH
66sNGa86cUnvtHxVLiFEP1BdZPcDQVGXxxgGpJ0n1EhJRzycs/JU3neNcyrAHNyV
of2n6KAn7G+gEXkjcgsFvsrWiUZiHHQh7EcE7pW7Zd3YhyoJHHLyluVdHX3Ow+RG
ZRDBGRO74OCNCm6Iw1sOthhpXsMqbKy4JWcINeKTdi2B3cWxzndIQRUzJWEUjlq2
k3lg5nWAUv8NBzhkgebEge+3gZJy512aby9xUhdcVuxbhWX1Zk+9mkZh2oIyzwGo
NlTiXC+S57H6b62Pw8lrzHwhRYbxbP3rigNyM42sCd6dz1VJK0m0K5sbDdTUE3/S
sczHMzVW2KmLv6IMeOD4XMB8uW0wwUTDTOHtRpy0wJYNS5k0Z5DdtmI8xBAK2MyK
mj3iMwF0Nd8InOIZdaziQ1BIQQAWLSwJ24hwVGj2LSMxRsp4yZFbXMp2uRieF6LR
2RqePxt2a68OKu0iD9lPXBZPCYwR8g6A2gqsdovZgJ3GIO6FGLRRVVWh5G1qJvtW
rxlmAx3EAL29TZ7S+DtIhVAWZV8ib2E8g76wXyVx73/Z+/nWcWFgOIfrSJIrFqXc
WuHaUlFnvKlLwBGWI3m3BxkewetxdXVlPsHdIjeH3ZwmnW+I6flAyEZ70SgYCY0X
gYtCeVZgxROACofVSuB3jSlousbt7DJbxQwechaJuJ8We7oyK74n7rpE8gIbDO6U
JNqPGBRW5k3p/937LxCpLbHon+CK3+UlDKwVX4e51788zoIWnyFOKtTgsKnPdwMi
ZOIyHGyzcVB1DE5YvxhnxkgoE8TRCFQcvu5RIpe/UI8krG02Xf1uKwJgERcrNdfw
HCl+8diZDtXzkwk800IBNfK8b+yMyXHO8aYvH9S736iNg+P5KjK3upHXupdYFCcv
wbKW1t1QU3Guf5vZUDuZd9GoZJmgQIUpOuV5DGsKMtOKHEtW3KwvrEgUw9oy4zJ+
Rapp8XvmC6dA9oOzMVWddSo1SVjrmB9Wq1b4NAv8sp5tChL+7BXbufc45ze/q9ow
rNEBkV2uBuvxD4103jP5ZV4gpNKkkcka6jOUbNKVTlzfrdo55YpSsuj3lLyGS4q1
hXzB5bwAZ1MUJVqWAMLJF7NkwZx0zHg9EyQVxd/Z6fbRIs1pGvuk6Iete7XfYHhe
k3059XJ882Pjd59q5nPrXj3ojNb3iXP5pt/A9tyabhXmWf/juM92yIgUgBGZlsfj
nEe0Le1+LkgqxZPT+ekBBQHNgMqnxhyWsmBiXHpGkqNvAMjHKEFuSb5ySsXZlx3q</CipherValue>
</CipherData>
</EncryptedData></pkif:CreateCertificateIn>
  </soapenv:Body>
</soapenv:Envelope>